Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/witnesses/competence_of_a_witness.html.txt.tmx
Source language: en
Languages: ga

source: The general rule in Irish law regarding competence of witnesses is that all human beings are competent witnesses
ga: Tá riail ghinearálta i ndlí na hÉireann a deireann go bhfuil gach duine daonna inniúil le bheith ina f(h)inné

source: In other words, everyone is capable of giving evidence in a case
ga: I bhfocail eile, tá gach duine ábalta fianaise a thabhairt i gcás cúirte

source: However, there are some exceptions
ga: Ach, tá éisceachtaí don riail sin ann

source: Sometimes two or more people may be charged with a criminal offence and they are tried at the same time
ga: In amanna bíonn beirt nó níos mó daoine cúisithe as coir choiriúil agus cuirtear triail orthu ag an am céanna

source: In that situation, the people being tried are called "co-accuseds" and the rule is that one co-accused cannot be called by the prosecution to give evidence against another co-accused
ga: Sa chás sin tugtar na comh-chúisithe orthu agus tá riail ann nach féidir leis na cúisitheoirí glaoch ar dhuine de na comh-chúisithe le fianaise a thabhairt i gcoinne duine eile acu

source: Originally the spouse of an accused was not competent to testify for either side in a case
ga: Ón tús ní raibh céile an chúisí inniúil le fianaise a thabhairt ar son aon taobh i gcás

source: However, the law has now changed and a spouse may give evidence for either the defence or the prosecution (unless he or she happens to be a co-accused)
ga: Ach, tá athrú ar an dlí anois agus is féidir leis an gcéile fianaise a thabhairt ar son na gcosantóirí nó na gcúisitheoirí (ach amháin sa chás gur comh-chúisí é/í an céile)

source: He or she may only be forced to testify for the prosecution against his or her spouse in certain circumstances
ga: Ní féidir iallach a chur air/uirthi fianaise a thabhairt i gcoinne a c(h)éile ar son na gcúisitheoirí i gcúinsí áirid

source: Originally children could only give evidence on oath and in order to take the oath, the child had to understand the nature and consequences of the oath
ga: Ón tús bhí leanaí in ann fianaise a thabhairt faoi mhionn agus ar mhaithe leis an mionn a thabhairt, b'éigean don leanbh nádúr agus torthaí an mhionna a thuiscint

source: Since the introduction of Sections 27 and 28 of the Criminal Evidence Act 1992 for criminal proceedings and Section 28 of the Children Act 1997 for civil proceedings, any court can accept evidence from a child under 14 years of age without the child taking the oath. The court must be satisfied that the child is capable of giving an intelligible account of what he/she witnessed
ga: Ach, tá athrú anois ar an dlí agus is féidir le leanbh faoi cheithre bliana déag d'aois fianaise a thabhairt i gcás coiriúil nó i gcás sibhialta gan mionn ná dearbhú a thabhairt

source: Even though such evidence is not on oath, the child is guilty of an offence if he/she knowingly gives evidence which is false or untrue
ga: Ní mór don chúirt a bheith sásta go bhfuil sé/sí ábalta cur síos intuigthe a thabhairt ar a tharla

source: This normally takes the form of a general conversation with the child but does not involve the judge asking questions about the evidence the child is about to give
ga: Ní mór do leanaí atá ós cionn ceithre bliana déag d'aois mionn nó dearbhú a thabhairt i gcónaí ar mhaithe le fianaise a thabhairt

source: People with mental disabilities
ga: Daoine faoi mhíchumas intinne

source: People with mental disabilities are dealt with in the exact same way as children under 14 years of age
ga: Is féidir le duine faoi mhíchumas intinne fianaise a thabhairt i gcás coiriúil nó sibhialta gan aon mhionn ná dearbhú a thabhairt

source: Under the Criminal Evidence Act 1992 and the Children Act 1997 if a court is satisfied that a person with a mental disability is capable of giving an intelligible account of the events which are relevant to the proceedings then the court may receive that evidence from the person without the oath
ga: Ach, ní mór don chúirt a bheith sásta go bhfuil sé/sí ábalta cur síos intuigthe a thabhairt ar a tharla

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
